smartboxchannel/EFEKTA-EINK213-TEMP-HUM-PRESS-SENSOR-NRF52840-V2/for_sandeepmistry_nRF5/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant
menu.reset=Reset




# Efekta AQ Sens V1 nRF52840 variants
###################

Efekta_aq_sens_v1_nRF52840.name=EFEKTA AQ Sens V1 nRF52840

Efekta_aq_sens_v1_nRF52840.upload.tool=sandeepmistry:openocd
Efekta_aq_sens_v1_nRF52840.upload.target=nrf52
Efekta_aq_sens_v1_nRF52840.upload.maximum_size=1048576

Efekta_aq_sens_v1_nRF52840.bootloader.tool=sandeepmistry:openocd

Efekta_aq_sens_v1_nRF52840.build.mcu=cortex-m4
Efekta_aq_sens_v1_nRF52840.build.f_cpu=16000000
Efekta_aq_sens_v1_nRF52840.build.board=EFEKTA_AQ_Sens_V1
Efekta_aq_sens_v1_nRF52840.build.core=nRF5
Efekta_aq_sens_v1_nRF52840.build.variant=EfektaAqSensV1
Efekta_aq_sens_v1_nRF52840.build.variant_system_lib=
Efekta_aq_sens_v1_nRF52840.build.extra_flags=-DNRF52840_XXAA
Efekta_aq_sens_v1_nRF52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Efekta_aq_sens_v1_nRF52840.build.ldscript=nrf52840_xxaa.ld

Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfxo=Crystal Oscillator
Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfrc=RC Oscillator
Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfsynt=Synthesized
Efekta_aq_sens_v1_nRF52840.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Efekta_aq_sens_v1_nRF52840.menu.reset.notenable=Don't enable
Efekta_aq_sens_v1_nRF52840.menu.reset.notenable.build.reset_flags=
Efekta_aq_sens_v1_nRF52840.menu.reset.enabled=Enable
Efekta_aq_sens_v1_nRF52840.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET


# Efekta MWS213 V2 nRF52840 variants
###################

Efekta_mws213_v2_nRF52840.name=EFEKTA MWS213 V2 nRF52840

Efekta_mws213_v2_nRF52840.upload.tool=sandeepmistry:openocd
Efekta_mws213_v2_nRF52840.upload.target=nrf52
Efekta_mws213_v2_nRF52840.upload.maximum_size=1048576

Efekta_mws213_v2_nRF52840.bootloader.tool=sandeepmistry:openocd

Efekta_mws213_v2_nRF52840.build.mcu=cortex-m4
Efekta_mws213_v2_nRF52840.build.f_cpu=16000000
Efekta_mws213_v2_nRF52840.build.board=EFEKTA_MWS213_V2
Efekta_mws213_v2_nRF52840.build.core=nRF5
Efekta_mws213_v2_nRF52840.build.variant=EFEKTA_MWS213_V2
Efekta_mws213_v2_nRF52840.build.variant_system_lib=
Efekta_mws213_v2_nRF52840.build.extra_flags=-DNRF52840_XXAA
Efekta_mws213_v2_nRF52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Efekta_mws213_v2_nRF52840.build.ldscript=nrf52840_xxaa.ld

Efekta_mws213_v2_nRF52840.menu.lfclk.lfxo=Crystal Oscillator
Efekta_mws213_v2_nRF52840.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Efekta_mws213_v2_nRF52840.menu.lfclk.lfrc=RC Oscillator
Efekta_mws213_v2_nRF52840.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Efekta_mws213_v2_nRF52840.menu.lfclk.lfsynt=Synthesized
Efekta_mws213_v2_nRF52840.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Efekta_mws213_v2_nRF52840.menu.reset.notenable=Don't enable
Efekta_mws213_v2_nRF52840.menu.reset.notenable.build.reset_flags=
Efekta_mws213_v2_nRF52840.menu.reset.enabled=Enable
Efekta_mws213_v2_nRF52840.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET


# Efekta MWSE154 nRF52840 variants
###################

Efekta_mws_e154_nRF52840.name=Efekta MWSE154 nRF52840

Efekta_mws_e154_nRF52840.upload.tool=sandeepmistry:openocd
Efekta_mws_e154_nRF52840.upload.target=nrf52
Efekta_mws_e154_nRF52840.upload.maximum_size=1048576

Efekta_mws_e154_nRF52840.bootloader.tool=sandeepmistry:openocd

Efekta_mws_e154_nRF52840.build.mcu=cortex-m4
Efekta_mws_e154_nRF52840.build.f_cpu=16000000
Efekta_mws_e154_nRF52840.build.board=Efekta_mWS_E154_840
Efekta_mws_e154_nRF52840.build.core=nRF5
Efekta_mws_e154_nRF52840.build.variant=Efekta_mWS_E154_840
Efekta_mws_e154_nRF52840.build.variant_system_lib=
Efekta_mws_e154_nRF52840.build.extra_flags=-DNRF52840_XXAA
Efekta_mws_e154_nRF52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Efekta_mws_e154_nRF52840.build.ldscript=nrf52840_xxaa.ld

Efekta_mws_e154_nRF52840.menu.lfclk.lfxo=Crystal Oscillator
Efekta_mws_e154_nRF52840.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Efekta_mws_e154_nRF52840.menu.lfclk.lfrc=RC Oscillator
Efekta_mws_e154_nRF52840.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Efekta_mws_e154_nRF52840.menu.lfclk.lfsynt=Synthesized
Efekta_mws_e154_nRF52840.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Efekta_mws_e154_nRF52840.menu.reset.notenable=Don't enable
Efekta_mws_e154_nRF52840.menu.reset.notenable.build.reset_flags=
Efekta_mws_e154_nRF52840.menu.reset.enabled=Enable
Efekta_mws_e154_nRF52840.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET




# Efekta MWSE154 nRF52832 variants
###################

Efekta_mws_e154_nRF52832.name=Efekta MWSE154 nRF52832

Efekta_mws_e154_nRF52832.upload.tool=sandeepmistry:openocd
Efekta_mws_e154_nRF52832.upload.target=nrf52
Efekta_mws_e154_nRF52832.upload.maximum_size=524288

Efekta_mws_e154_nRF52832.bootloader.tool=sandeepmistry:openocd

Efekta_mws_e154_nRF52832.build.mcu=cortex-m4
Efekta_mws_e154_nRF52832.build.f_cpu=16000000
Efekta_mws_e154_nRF52832.build.board=Efekta_mWS_E154_832
Efekta_mws_e154_nRF52832.build.core=nRF5
Efekta_mws_e154_nRF52832.build.variant=Efekta_mWS_E154_832
Efekta_mws_e154_nRF52832.build.variant_system_lib=
Efekta_mws_e154_nRF52832.build.extra_flags=-DNRF52
Efekta_mws_e154_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Efekta_mws_e154_nRF52832.build.ldscript=nrf52_xxaa.ld

Efekta_mws_e154_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Efekta_mws_e154_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Efekta_mws_e154_nRF52832.menu.lfclk.lfrc=RC Oscillator
Efekta_mws_e154_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Efekta_mws_e154_nRF52832.menu.lfclk.lfsynt=Synthesized
Efekta_mws_e154_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Efekta_mws_e154_nRF52832.menu.reset.notenable=Don't enable
Efekta_mws_e154_nRF52832.menu.reset.notenable.build.reset_flags=
Efekta_mws_e154_nRF52832.menu.reset.enabled=Enable
Efekta_mws_e154_nRF52832.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET




