smartboxchannel/EFEKTA-EINK213-TEMP-HUM-PRESS-SENSOR-NRF52840-V2/for_sandeepmistry_nRF5/boards.txt
Generic_nRF52805.name=Generic nRF52805

Generic_nRF52805.upload.tool=sandeepmistry:openocd
Generic_nRF52805.upload.target=nrf52
Generic_nRF52805.upload.maximum_size=196608

Generic_nRF52805.bootloader.tool=sandeepmistry:openocd

Generic_nRF52805.build.mcu=cortex-m4
Generic_nRF52805.build.f_cpu=16000000
Generic_nRF52805.build.board=GENERIC
Generic_nRF52805.build.core=nRF5
Generic_nRF52805.build.variant=Generic
Generic_nRF52805.build.variant_system_lib=
Generic_nRF52805.build.extra_flags=-DNRF52805_XXAA
Generic_nRF52805.build.float_flags=-mfloat-abi=soft
Generic_nRF52805.build.ldscript=nrf52805_xxaa.ld

Generic_nRF52805.menu.softdevice.none=None
Generic_nRF52805.menu.softdevice.none.softdevice=none
Generic_nRF52805.menu.softdevice.none.softdeviceversion=

Generic_nRF52805.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52805.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52805.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52805.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52805.menu.lfclk.lfsynt=Synthesized
Generic_nRF52805.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52805.menu.reset.notenable=Don't enable
Generic_nRF52805.menu.reset.notenable.build.reset_flags=
Generic_nRF52805.menu.reset.enabled=Enable
Generic_nRF52805.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET



# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52832

Generic_nRF52832.upload.tool=sandeepmistry:openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=sandeepmistry:openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=16000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.extra_flags=-DNRF52
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld

Generic_nRF52832.menu.softdevice.none=None
Generic_nRF52832.menu.softdevice.none.softdevice=none
Generic_nRF52832.menu.softdevice.none.softdeviceversion=

Generic_nRF52832.menu.softdevice.s132=S132
Generic_nRF52832.menu.softdevice.s132.softdevice=s132
Generic_nRF52832.menu.softdevice.s132.softdeviceversion=2.0.1
Generic_nRF52832.menu.softdevice.s132.upload.maximum_size=409600
Generic_nRF52832.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
Generic_nRF52832.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52832.menu.reset.notenable=Don't enable
Generic_nRF52832.menu.reset.notenable.build.reset_flags=
Generic_nRF52832.menu.reset.enabled=Enable
Generic_nRF52832.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET



# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=sandeepmistry:openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=sandeepmistry:openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=16000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.extra_flags=-DNRF52833_XXAA
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld

Generic_nRF52833.menu.softdevice.none=None
Generic_nRF52833.menu.softdevice.none.softdevice=none
Generic_nRF52833.menu.softdevice.none.softdeviceversion=

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.reset.notenable=Don't enable
Generic_nRF52833.menu.reset.notenable.build.reset_flags=
Generic_nRF52833.menu.reset.enabled=Enable
Generic_nRF52833.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET



# nRF52840 variants
###################

Generic_nRF52840.name=Generic nRF52840

Generic_nRF52840.upload.tool=sandeepmistry:openocd
Generic_nRF52840.upload.target=nrf52
Generic_nRF52840.upload.maximum_size=1048576

Generic_nRF52840.bootloader.tool=sandeepmistry:openocd

Generic_nRF52840.build.mcu=cortex-m4
Generic_nRF52840.build.f_cpu=16000000
Generic_nRF52840.build.board=GENERIC
Generic_nRF52840.build.core=nRF5
Generic_nRF52840.build.variant=Generic
Generic_nRF52840.build.variant_system_lib=
Generic_nRF52840.build.extra_flags=-DNRF52840_XXAA
Generic_nRF52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52840.build.ldscript=nrf52840_xxaa.ld

Generic_nRF52840.menu.softdevice.none=None
Generic_nRF52840.menu.softdevice.none.softdevice=none
Generic_nRF52840.menu.softdevice.none.softdeviceversion=

Generic_nRF52840.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52840.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52840.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52840.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52840.menu.lfclk.lfsynt=Synthesized
Generic_nRF52840.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52840.menu.reset.notenable=Don't enable
Generic_nRF52840.menu.reset.notenable.build.reset_flags=
Generic_nRF52840.menu.reset.enabled=Enable
Generic_nRF52840.menu.reset.enabled.build.reset_flags=-DCONFIG_GPIO_AS_PINRESET



BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=sandeepmistry:openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;
BBCmicrobitV2.upload.use_1200bps_touch=false
BBCmicrobitV2.upload.wait_for_upload_port=false
BBCmicrobitV2.upload.native_usb=false

BBCmicrobitV2.bootloader.tool=sandeepmistry:openocd

